#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aviatrix-course/ace-automation-dcf/runs/run-A4StBrLQo1oHCUgx

Waiting for the plan to start...

Terraform v1.13.3
on linux_amd64
Initializing plugins and modules...
aviatrix_web_group.allow_internet_https: Refreshing state... [id=d06bfee1-c4b0-41c3-ba98-fde12143c0de]
aviatrix_smart_group.rfc1918: Refreshing state... [id=4e2673f6-2e79-48f8-98bb-b035d713e44c]
aviatrix_distributed_firewalling_policy_list.default: Refreshing state... [id=54-71-194-167]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aviatrix_smart_group.rfc1918 has been deleted
  - resource "aviatrix_smart_group" "rfc1918" {
        id   = "4e2673f6-2e79-48f8-98bb-b035d713e44c"
        name = "rfc1918"
      - uuid = "4e2673f6-2e79-48f8-98bb-b035d713e44c" -> null

        # (1 unchanged block hidden)
    }

  # aviatrix_web_group.allow_internet_https has been deleted
  - resource "aviatrix_web_group" "allow_internet_https" {
        id   = "d06bfee1-c4b0-41c3-ba98-fde12143c0de"
        name = "allow-internet-https"
      - uuid = "d06bfee1-c4b0-41c3-ba98-fde12143c0de" -> null

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aviatrix_distributed_firewalling_policy_list.default will be updated in-place
  ~ resource "aviatrix_distributed_firewalling_policy_list" "default" {
        id = "16-145-66-1"

      ~ policies {
          ~ dst_smart_groups         = [
              - "def000ad-0000-0000-0000-000000000000",
              + "def000ad-0000-0000-0000-000000000001",
            ]
          ~ name                     = "allow-all" -> "allow-internet"
          ~ protocol                 = "ANY" -> "TCP"
          ~ src_smart_groups         = [
              - "def000ad-0000-0000-0000-000000000000",
            ] -> (known after apply)
          ~ web_groups               = [] -> (known after apply)
            # (9 unchanged attributes hidden)

          + port_ranges {
              + lo = 443
            }
        }

        # (1 unchanged block hidden)
    }

  # aviatrix_smart_group.rfc1918 will be created
  + resource "aviatrix_smart_group" "rfc1918" {
      + id   = (known after apply)
      + name = "rfc1918"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + cidr = "10.0.0.0/8"
            }
          + match_expressions {
              + cidr = "172.16.0.0/12"
            }
          + match_expressions {
              + cidr = "192.168.0.0/16"
            }
        }
    }

  # aviatrix_web_group.allow_internet_https will be created
  + resource "aviatrix_web_group" "allow_internet_https" {
      + id   = (known after apply)
      + name = "allow-internet-https"
      + uuid = (known after apply)

      + selector {
          + match_expressions {
              + snifilter = "*.amazonaws.com"
            }
          + match_expressions {
              + snifilter = "*.microsoft.com"
            }
          + match_expressions {
              + snifilter = "aviatrix.com"
            }
          + match_expressions {
              + snifilter = "cloud.google.com"
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.


</details>
Pusher: @eliyahuadam, Action: `pull_request